import { useMemo } from "react";

export type GenresData = string[];

function useGenres(): GenresData {
  const genres = useMemo(
    () => [
      "R&B",
      "アカペラ",
      "アニメソング",
      "オリジナル",
      "カントリー",
      "クラシック",
      "グラインドコア",
      "グランジ",
      "ゴシックメタル",
      "ゴスペル",
      "ジャズ",
      "スカ",
      "スラッシュメタル",
      "ソウル",
      "テクノ",
      "デスメタル",
      "ハウス",
      "ハードコア",
      "ハードロック",
      "パンク",
      "ヒップホップ",
      "ビジュアル系",
      "ファンク",
      "フォーク",
      "フュージョン",
      "ブラスバンド",
      "ブルース",
      "ヘビーメタル",
      "ボサノバ",
      "ボーカロイド",
      "ポップス",
      "ミクスチャー",
      "メロコア",
      "ラウド",
      "ラテン",
      "レゲエ",
      "ロカビリー",
      "ロック",
      "その他",
    ],
    []
  );

  return genres;
}

export default useGenres;
