import { useMemo } from "react";

export type PartsData = string[];

function useParts(): PartsData {
  const parts = useMemo(
    () => [
      "DJ",
      "DTM",
      "アコースティックギター",
      "アコーディオン",
      "アルトサックス",
      "アレンジャー",
      "ウッドベース",
      "エレキギター",
      "エレキベース",
      "オカリナ",
      "オーボエ",
      "キーボード",
      "クラリネット",
      "コンガ",
      "コントラバス",
      "コーラス",
      "サウンドクリエイション",
      "ソプラノサックス",
      "ダンサー",
      "チェロ",
      "テナーサックス",
      "トランペット",
      "トロンボーン",
      "ドラム",
      "ハープ",
      "バイオリン",
      "パーカッション",
      "ビオラ",
      "ピアノ",
      "ピッコロ",
      "ファゴット",
      "フルート",
      "ホルン",
      "ボンゴ",
      "ボーカル",
      "ミキサー",
      "リコーダー",
      "作曲",
      "作詞",
      "和楽器",
      "木琴",
      "民族楽器",
      "鉄琴",
      "その他",
    ],
    []
  );

  return parts;
}

export default useParts;
